Authorization/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])